Reports/AlcoholicProductsSalesBook.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>AlcoholicProductsSalesBook</Name>
			<Comment>Book of retail sales of alcoholic and alcohol-containing products</Comment>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Inventory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Inventory</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>StructuralUnitCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsAndServicesCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CharacteristicCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BatchCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerCorrOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Specification</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Specifications</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpecificationCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Specifications</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderSales</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InventoryWriteOff</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
						<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.RetailReport</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Division</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixedCost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductionExpenses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Return</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetailTransferAccrualAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CustomerOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/OperationKindsCustomerOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerOrder</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OrderForSale</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OrderForProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JobOrder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsSupplierInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsSupplierInvoice</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ReceiptFromVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceptionForCommission</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceptionIntoProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceptionForSafeCustody</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromAgent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSubcontractor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSafeCustody</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsCustomerInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsCustomerInvoice</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SaleToCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferForCommission</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferForSafeCustody</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnToVendor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnToPrincipal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromProcessing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromSafeCustody</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OperationKindsInventoryTransfer.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsInventoryTransfer</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Move</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WriteOffToExpenses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferToOperation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReturnFromExploitation</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/StructuralUnitsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>StructuralUnitsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Division</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Warehouse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetailAccrualAccounting</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/InventoryReservation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>InventoryReservation</Name>
			<BasedOn>
				<xr:Item>Document.CustomerOrder</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.OrdersPlacement</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OriginalReservePlace</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NewReservePlace</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/AlcoholicProductsSalesBook/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure OnComposeResult(ResultDocument, DetailsData, StandardProcessing)
	
	StandardProcessing = False;
	Template = Reports.AlcoholicProductsSalesBook.GetTemplate("Template");
	
	ReportParameters = SettingsComposer.GetSettings();
	
	Period		= ReportParameters.DataParameters.FindParameterValue(
					New DataCompositionParameter("Period")).Value;
	Company = ReportParameters.DataParameters.FindParameterValue(
					New DataCompositionParameter("Company")).Value;
	Warehouse		= ReportParameters.DataParameters.FindParameterValue(
					New DataCompositionParameter("Warehouse")).Value;
					
	If Not ValueIsFilled(Company) Then
		Raise NStr("en = 'Value of mandatory parameter ""Company"" is not filled in'");
	EndIf;
	If Not ValueIsFilled(Warehouse) Then
		Raise NStr("en = 'Value of mandatory parameter ""Warehouse"" is not filled in'");
	EndIf;
	
	InfoAboutCompany = SmallBusinessServer.InfoAboutLegalEntityIndividual(Company, Period.EndDate);

	ResultDocument.FitToPage = True;
	ResultDocument.PageOrientation = PageOrientation.Landscape;
	ResultDocument.RepeatOnRowPrint = ResultDocument.Area(11,, 11,);
	
	OutputCoverPage = ReportParameters.DataParameters.FindParameterValue(New DataCompositionParameter("OutputCoverPage")).Value;
	If OutputCoverPage = True Then
		AreaCompany = Template.GetArea("FrontSheet");
		
		AreaCompany.Parameters.PeriodPresentation = PeriodPresentation(Period.StartDate, Period.EndDate);
		AreaCompany.Parameters.CompanyName = SmallBusinessServer.CompaniesDescriptionFull(InfoAboutCompany, "FullDescr");
		AreaCompany.Parameters.Warehouse = Warehouse;
		
		ResultDocument.Put(AreaCompany);
		ResultDocument.PutHorizontalPageBreak();
		
		ResultDocument.Area("R1:R" + ResultDocument.TableHeight).Name = "FrontSheet";
	EndIf;
	
	TemplateArea = Template.GetArea("Header");
	ResultDocument.Put(TemplateArea);
	ResultDocument.RepeatOnRowPrint = ResultDocument.Area(11, , 11, );

	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.SetParameter("Company", Company);
	Query.SetParameter("Warehouse", Warehouse);
	Query.SetParameter("StartDate", BegOfDay(Period.StartDate));
	Query.SetParameter("EndDate", EndOfDay(Period.EndDate));
	Query.SetParameter("Receipt", AccumulationRecordType.Receipt);
	Query.SetParameter("IsBlankString", "");
	Query.SetParameter("BlankDate", Date(1, 1, 1));
	
	Query.Text = 
	"SELECT ALLOWED
	|	ProductsFlow.Recorder AS Recorder,
	|	ProductsFlow.Period AS Period,
	|	ProductsFlow.Recorder.Number AS Number,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN SupplierInvoice.IncomingDocumentDate
	|		ELSE &BlankDate
	|	END AS IncomingDocumentDate,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN SupplierInvoice.IncomingDocumentNumber
	|		ELSE &IsBlankString
	|	END AS IncomingDocumentNumber,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN CAST(ISNULL(Counterparties.DescriptionFull, &IsBlankString) AS String(200))
	|		ELSE &IsBlankString
	|	END AS CounterpartyDescription,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN ISNULL(Counterparties.TIN, &IsBlankString)
	|		ELSE &IsBlankString
	|	END AS TIN,
	|	ISNULL(ProductsFlow.ProductsAndServices.AlcoholicProductsKind, &IsBlankString) AS ProductsKind,
	|	ISNULL(ProductsFlow.ProductsAndServices.AlcoholicProductsKind.Code, &IsBlankString) AS KindCode,
	|	ISNULL(ProductsFlow.ProductsAndServices.VolumeDAL, 0) * 10 AS Capacity,
	|	SUM(ProductsFlow.Quantity) AS Quantity,
	|	SUM(ISNULL(ProductsFlow.ProductsAndServices.VolumeDAL, 0) * ProductsFlow.Quantity) AS Volume,
	|	ProductsFlow.RecordType AS RecordType,
	|	ProductsFlow.Recorder.OperationKind AS OperationKind,
	|	ProductsFlow.StructuralUnitCorr AS StructuralUnitCorr,
	|	ProductsFlow.ProductsAndServices AS ProductsAndServices
	|FROM
	|	AccumulationRegister.Inventory AS ProductsFlow
	|		LEFT JOIN Document.SupplierInvoice AS SupplierInvoice
	|		ON (SupplierInvoice.Ref = ProductsFlow.Recorder)
	|		LEFT JOIN Catalog.Counterparties AS Counterparties
	|		ON (Counterparties.Ref = SupplierInvoice.Counterparty)
	|WHERE
	|	ProductsFlow.Period between &StartDate AND &EndDate
	|	AND ProductsFlow.StructuralUnit = &Warehouse
	|	AND ProductsFlow.Recorder.Company = &Company
	|	AND ProductsFlow.ProductsAndServices.AlcoholicProductsKind <> VALUE(Catalog.AlcoholicProductsKinds.EmptyRef)
	|	AND Not(VALUETYPE(ProductsFlow.Recorder) = Type(Document.CustomerOrder)
	|					AND ProductsFlow.Recorder.OperationKind = VALUE(Enum.OperationKindsCustomerOrder.OrderForSale)
	|				OR VALUETYPE(ProductsFlow.Recorder) = Type(Document.InventoryReservation)
	|				OR VALUETYPE(ProductsFlow.Recorder) = Type(Document.CustomerOrder)
	|					AND ProductsFlow.ContentOfAccountingRecord = ""Inventory reservation"")
	|
	|GROUP BY
	|	ProductsFlow.Recorder,
	|	ProductsFlow.Period,
	|	ProductsFlow.Recorder.Number,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN SupplierInvoice.IncomingDocumentDate
	|		ELSE &BlankDate
	|	END,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN SupplierInvoice.IncomingDocumentNumber
	|		ELSE &IsBlankString
	|	END,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN CAST(ISNULL(Counterparties.DescriptionFull, &IsBlankString) AS String(200))
	|		ELSE &IsBlankString
	|	END,
	|	CASE
	|		WHEN ProductsFlow.Recorder REFS Document.SupplierInvoice
	|			THEN ISNULL(Counterparties.TIN, &IsBlankString)
	|		ELSE &IsBlankString
	|	END,
	|	ProductsFlow.ProductsAndServices.AlcoholicProductsKind,
	|	ISNULL(ProductsFlow.ProductsAndServices.VolumeDAL, 0) * 10,
	|	ProductsFlow.RecordType,
	|	ISNULL(ProductsFlow.ProductsAndServices.AlcoholicProductsKind.Code, &IsBlankString),
	|	ProductsFlow.Recorder.OperationKind,
	|	ProductsFlow.StructuralUnitCorr,
	|	ProductsFlow.ProductsAndServices
	|
	|ORDER BY
	|	Period";
	
	Selection = Query.Execute().Select();
	
	LineNumber = 0;
	TotalVolumeReceipt = 0;
	TotalVolumeExpense = 0;
	TotalQuantityReceipt = 0;
	TotalQuantityExpense = 0;
	
	TemplateArea = Template.GetArea("String");

	While Selection.Next() Do
		
		LineNumber = LineNumber + 1;
		
		FillPropertyValues(TemplateArea.Parameters, Selection);
		TemplateArea.Parameters.LineNumber = LineNumber;
		TemplateArea.Parameters.Recorder = Selection.Recorder;
		
		ProductsName = StringFunctionsClientServer.PlaceParametersIntoString("%1 (%2)",
			Selection.ProductsKind, TrimAll(Selection.ProductsAndServices));
		
		If Selection.RecordType = AccumulationRecordType.Receipt
			AND Not (TypeOf(Selection.Recorder) = Type("DocumentRef.SupplierInvoice")
				AND Selection.OperationKind = Enums.OperationKindsSupplierInvoice.ReturnFromCustomer)
			AND Not (TypeOf(Selection.Recorder) = Type("DocumentRef.CustomerInvoice")
				AND Selection.OperationKind = Enums.OperationKindsCustomerInvoice.ReturnToVendor) Then
			
			TemplateArea.Parameters.RecorderReceipt = Selection.Recorder;
			
			If ValueIsFilled(Selection.IncomingDocumentDate) Then
				TemplateArea.Parameters.BOLDate = Selection.IncomingDocumentDate;
			Else
				TemplateArea.Parameters.BOLDate = Selection.Period;
			EndIf;
			If ValueIsFilled(Selection.IncomingDocumentNumber) Then
				TemplateArea.Parameters.BOLNumber = Selection.IncomingDocumentNumber;
			Else
				TemplateArea.Parameters.BOLNumber = Selection.Number;
			EndIf;
			If TypeOf(Selection.Recorder) = Type("DocumentRef.SupplierInvoice")
				AND Selection.OperationKind = Enums.OperationKindsSupplierInvoice.ReceiptFromVendor Then
				TemplateArea.Parameters.Vendor = Selection.CounterpartyDescription;
				TemplateArea.Parameters.TINReceipt = Selection.TIN;
			Else
				TemplateArea.Parameters.Vendor = InfoAboutCompany.FullDescr;
				TemplateArea.Parameters.TINReceipt = InfoAboutCompany.TIN;
			EndIf;
			
			TemplateArea.Parameters.KindGoodsReceipt = ProductsName;
			TemplateArea.Parameters.KindCodeReceipt = Selection.KindCode;
			
			TemplateArea.Parameters.CapacityReceipt = Selection.Capacity;
			TemplateArea.Parameters.QuantityReceipt = Selection.Count;
			
			TemplateArea.Parameters.RecorderExpense = Undefined;
			TemplateArea.Parameters.ExpenceContent = "";
			TemplateArea.Parameters.ProductionExpenseKind = "";
			TemplateArea.Parameters.CapacityExpense = 0;
			TemplateArea.Parameters.QuantityExpense = 0;
			
			TotalVolumeReceipt = TotalVolumeReceipt + Selection.Volume;
			TotalQuantityReceipt = TotalQuantityReceipt + Selection.Count;
			
		Else
			
			TemplateArea.Parameters.RecorderReceipt = Undefined;
			TemplateArea.Parameters.BOLDate = "";
			TemplateArea.Parameters.BOLNumber = "";
			TemplateArea.Parameters.Vendor = "";
			TemplateArea.Parameters.TINReceipt = "";
			TemplateArea.Parameters.KindGoodsReceipt = "";
			TemplateArea.Parameters.KindCodeReceipt = "";
			TemplateArea.Parameters.CapacityReceipt = 0;
			TemplateArea.Parameters.QuantityReceipt = 0;
			
			TemplateArea.Parameters.RecorderExpense = Selection.Recorder;
			
			VolumeExpense = Selection.Volume;
			QuantityExpense = Selection.Count;
			
			If TypeOf(Selection.Recorder) = Type("DocumentRef.RetailReport")
				OR (TypeOf(Selection.Recorder) = Type("DocumentRef.CustomerInvoice")
				AND Selection.OperationKind = Enums.OperationKindsCustomerInvoice.SaleToCustomer)
				OR (TypeOf(Selection.Recorder) = Type("DocumentRef.SupplierInvoice")
				AND Selection.OperationKind = Enums.OperationKindsSupplierInvoice.ReturnFromCustomer) Then
				
				ContentOperations = NStr("en = 'Sold products'");
				
			ElsIf TypeOf(Selection.Recorder) = Type("DocumentRef.CustomerInvoice")
				AND Selection.OperationKind = Enums.OperationKindsCustomerInvoice.ReturnToVendor Then
				
				ContentOperations = NStr("en = 'Products returned to the supplier'");
				VolumeExpense = - VolumeExpense;
				QuantityExpense = - QuantityExpense;
				
			ElsIf TypeOf(Selection.Recorder) = Type("DocumentRef.InventoryWriteOff") Then
				
				ContentOperations = NStr("en = 'Shortage of products'");
				
			ElsIf TypeOf(Selection.Recorder) = Type("DocumentRef.InventoryTransfer")
				AND Selection.OperationKind = Enums.OperationKindsInventoryTransfer.Move
				AND Selection.StructuralUnitCorr.StructuralUnitType <> Enums.StructuralUnitsTypes.Division Then
				
				ContentOperations = NStr("en = 'Products transferred to other division'");
				
			Else
				
				ContentOperations = NStr("en = 'Written-off products'");
				
			EndIf;
			
			TemplateArea.Parameters.ExpenceContent = ContentOperations;
			TemplateArea.Parameters.ProductionExpenseKind = ProductsName;
			TemplateArea.Parameters.CapacityExpense = Selection.Capacity;
			TemplateArea.Parameters.QuantityExpense = QuantityExpense;
			
			TotalVolumeExpense = TotalVolumeExpense + VolumeExpense;
			TotalQuantityExpense = TotalQuantityExpense + QuantityExpense;
			
		EndIf;
		
		ResultDocument.Put(TemplateArea);
		
		ResultDocument.RepeatOnRowPrint = ResultDocument.Area("RowsForRepeat");
		
	EndDo;
	
	TemplateArea = Template.GetArea("Totals");
	
	TemplateArea.Parameters.VolumeReceipt = TotalVolumeReceipt;
	TemplateArea.Parameters.VolumeExpense = TotalVolumeExpense;
	TemplateArea.Parameters.QuantityReceipt = TotalQuantityReceipt;
	TemplateArea.Parameters.QuantityExpense = TotalQuantityExpense;
	
	ResultDocument.Put(TemplateArea);
	
EndProcedure

#EndRegion

#EndIf
